zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_bsec.c
  * @author  MCD Application Team
  * @brief   BSEC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of Boot and SECurity (BSEC):
  *           + Initialization and de-initialization functions
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
    [..]
    The BSEC HAL driver can be used as follows:



    *** High level operation ***
    =================================


    *** Low level operation ***
    =================================


  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

#if defined(BSEC) && defined(HAL_BSEC_MODULE_ENABLED)

/** @defgroup BSEC BSEC
  * @brief BSEC HAL module driver.
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup BSEC_Private_Constants BSEC Private Constants
  * @{
  */
#if  defined(BSEC_HDPLSR_HDPL)
#define BSEC_HDPL_INCREMENT_CODE     0x60B166E7U
#endif /*defined(BSEC_HDPLSR_HDPL)*/

#define BSEC_NB_FUSES                376U
#define BSEC_LIMIT_UPPER_FUSES       256U
#define BSEC_NB_SHADOW_REG           BSEC_NB_FUSES

#if  defined(BSEC_EPOCHSELR_EPSEL)
#define BSEC_NB_EPOCH_COUNTER        2U
#endif /*defined(BSEC_EPOCHSELR_EPSEL)*/

#define BSEC_NB_SCRATCH_REG          4U
#define BSEC_NB_WOSCR_REG            8U
#define BSEC_OTPSR_RELOAD_ERRORS     (BSEC_OTPSR_DISTURBF | BSEC_OTPSR_DEDF | BSEC_OTPSR_AMEF)
#define BSEC_SHADOW_REG_WRITE_LIMIT  9U
#define BSEC_TIMEOUT                 1000U
/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup BSEC_Private_Functions BSEC Private Functions
  * @{
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup BSEC_Exported_Functions BSEC Exported Functions
  * @{
  */

/** @defgroup BSEC_Exported_Functions_Group1 General configuration functions
  *  @brief   General configuration functions
  *
@verbatim
 ===============================================================================
                ##### General configuration functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to perform global
  configuration of BSEC.

      (+) Call the function HAL_BSEC_GetStatus() to get the status of BSEC
    peripheral.

      (+) Call the function HAL_BSEC_GlobalLock() to lock the write to BSEC
    registers.

      (+) Call the function HAL_BSEC_GetGlobalLockStatus() to get the global
    write registers lock status.

      (+) Call the function HAL_BSEC_GetErrorCode() to get the error code
    raised when API return HAL_ERROR.

@endverbatim
  * @{
  */

/**
  * @brief  Get the status of BSEC peripheral.
  *
  * @param  pHbsec   BSEC handle
  * @param  pStatus  Returned value of BSEC status. The returned value is @ref BSEC_Status
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetStatus(BSEC_HandleTypeDef *const pHbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pStatus == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  *pStatus = (pHbsec->Instance->OTPSR & (BSEC_OTPSR_INIT_DONE | BSEC_OTPSR_HIDEUP | BSEC_OTPSR_OTPNVIR));

  return HAL_OK;
}

/**
  * @brief  Lock the write to BSEC registers.
  *
  * @param  pHbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GlobalLock(BSEC_HandleTypeDef *pHbsec)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Set the value of global lock */
  SET_BIT(pHbsec->Instance->LOCKR, BSEC_LOCKR_GWLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the global write registers lock status.
  *
  * @param  pHbsec  BSEC handle
  * @param  pStatus  Returned value of global lock status. The returned value is @ref BSEC_Global_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetGlobalLockStatus(BSEC_HandleTypeDef *const pHbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pStatus == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Get the global lock status */
  *pStatus = (pHbsec->Instance->LOCKR & BSEC_LOCKR_GWLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the error code of BSEC driver.
  *
  * @param  pHbsec  BSEC handle
  * @param  pError  Returned value of error code. The returned value is @ref BSEC_Error_Code
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetErrorCode(BSEC_HandleTypeDef *const pHbsec, uint32_t *pError)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

