zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
  /* Check the address of returned value */
  if (pError == NULL)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  *pError = pHbsec->ErrorCode;

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group2 OTP fuse management functions
  *  @brief   OTP fuse management functions
  *
@verbatim
 ===============================================================================
                  ##### OTP fuse management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the OTP fuses.

      (+) Call the function HAL_BSEC_OTP_Read() to read the value of
    an OTP fuse.

      (+) Call the function HAL_BSEC_OTP_Program() to program an OTP
    fuse with or without permanent lock.

      (+) Call the function HAL_BSEC_OTP_Reload() to reload an OTP
    fuse value.

      (+) Call the function HAL_BSEC_OTP_Lock() to sticky lock
    an OTP fuse programming, writing shadowed register or reload.

      (+) Call the function HAL_BSEC_OTP_GetState() to get the sticky lock
    status (programming, writing shadowed register or reload), the permanent
    lock status, the shadow configuration, the ECC or hidden status of an
    OTP fuse.

@endverbatim
  * @{
  */

/**
  * @brief  Read OTP fuse value.
  *
  * @param  pHbsec     BSEC handle
  * @param  FuseId     Fuse to be read, this parameter value is between 0 and 375
  * @param  pFuseData  Returned value of fuse. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Read(BSEC_HandleTypeDef *const pHbsec, uint32_t FuseId, uint32_t *pFuseData)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pFuseData == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  if (FuseId < BSEC_NB_FUSES)
  {
    /* Reload the data :
       - Unshadowed fuse are not automatically reload and data no more available after register read
       - Shadowed fuse contains by default the shadow value in the register */
    if ((HAL_BSEC_OTP_Reload(pHbsec, FuseId) == HAL_OK))
    {
      /* Read data from shadow register */
      *pFuseData = pHbsec->Instance->FVRw[FuseId];
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Program an OTP fuse with or without permanent lock.
  *
  * @param  pHbsec    BSEC handle
  * @param  FuseId    Fuse to be written, this parameter value is between 0 and 375
  * @param  FuseData  Data to be written in fuse, this parameter value is between 0 and 0xFFFFFFFFU
  * @param  Lock      Permanent lock value, this parameter is @ref BSEC_Permanent_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Program(BSEC_HandleTypeDef *pHbsec, uint32_t FuseId, uint32_t FuseData, uint32_t Lock)
{
  uint32_t status_reg;
  uint32_t status_bit;
  uint32_t read_data;
  uint32_t tick_start = HAL_GetTick();

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the permanent lock */
  assert_param(IS_BSEC_PERMANENT_LOCK(Lock));

  /* Get the correct register value */
  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    if ((pHbsec->Instance->SPLOCKx[status_reg] & status_bit) == 0U)
    {
      /* Write data in register */
      pHbsec->Instance->WDR = FuseData;

      /* Perform a program of the fuse register */
      MODIFY_REG(pHbsec->Instance->OTPCR, (BSEC_OTPCR_PPLOCK | BSEC_OTPCR_PROG | BSEC_OTPCR_ADDR),
                 (FuseId | BSEC_OTPCR_PROG | Lock));

      /* Wait the operation is finished */
      while ((pHbsec->Instance->OTPSR & BSEC_OTPSR_BUSY) != 0U)
      {
        if ((HAL_GetTick() - tick_start) > BSEC_TIMEOUT)
        {
          pHbsec->ErrorCode = HAL_BSEC_TIMEOUT_ERROR;
          return HAL_ERROR;
        }
      }

      /* Check programming errors */
      if ((pHbsec->Instance->OTPSR & BSEC_OTPSR_PROGFAIL) != 0U)
      {
        pHbsec->ErrorCode = HAL_BSEC_PROGFAIL_ERROR;
        return HAL_ERROR;
      }

      /* Read back programmed data */
      if (HAL_BSEC_OTP_Read(pHbsec, FuseId, &read_data) == HAL_OK)
      {
        /* Verify programmed data */
        if (read_data != FuseData)
        {
          pHbsec->ErrorCode = HAL_BSEC_PROGFAIL_ERROR;
          return HAL_ERROR;
        }
      }
      else
      {
        return HAL_ERROR;
      }
    }
    else
    {
      /* Fuse is sticky programming locked */
      pHbsec->ErrorCode = HAL_BSEC_LOCK_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Reload a OTP fuse value.
  *
  * @param  pHbsec  BSEC handle
  * @param  FuseId  Fuse to be reload, this parameter value is between 0 and 375
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Reload(BSEC_HandleTypeDef *pHbsec, uint32_t FuseId)
{
  uint32_t status_reg;
  uint32_t status_bit;
  uint32_t tick_start = HAL_GetTick();

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    if ((pHbsec->Instance->SRLOCKx[status_reg] & status_bit) == 0U)
    {
      /* Perform a reload of the fuse register */
      MODIFY_REG(pHbsec->Instance->OTPCR, (BSEC_OTPCR_PPLOCK | BSEC_OTPCR_PROG | BSEC_OTPCR_ADDR), FuseId);

      /* Wait the operation is finished */
      while ((pHbsec->Instance->OTPSR & BSEC_OTPSR_BUSY) != 0U)
      {
        if ((HAL_GetTick() - tick_start) > BSEC_TIMEOUT)
        {
          pHbsec->ErrorCode = HAL_BSEC_TIMEOUT_ERROR;
          return HAL_ERROR;
        }
      }

