zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
      if ((pHbsec->Instance->OTPSR & BSEC_OTPSR_RELOAD_ERRORS) != 0U)
      {
        /* An error occurred during reloading, value can't be relied on */
        pHbsec->ErrorCode = (pHbsec->Instance->OTPSR & BSEC_OTPSR_RELOAD_ERRORS);
        return HAL_ERROR;
      }
    }
    else
    {
      /* Shadow register is sticky reload locked */
      pHbsec->ErrorCode = HAL_BSEC_LOCK_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Sticky lock an OTP fuse programming, writing shadowed register or reload.
  *
  * @param  pHbsec  BSEC handle
  * @param  FuseId  Fuse to lock, this parameter value is between 0 and 375
  * @param  Lock    Lock status of the fuse, this parameter is a combination of
  *                   @ref HAL_BSEC_FUSE_PROG_LOCKED,
  *                   @ref HAL_BSEC_FUSE_WRITE_LOCKED,
  *                   @ref HAL_BSEC_FUSE_RELOAD_LOCKED
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_Lock(BSEC_HandleTypeDef *pHbsec, uint32_t FuseId, uint32_t Lock)
{
  uint32_t status_reg;
  uint32_t status_bit;

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the lock configuration */
  assert_param(IS_BSEC_LOCK_CFG(Lock));

  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    if ((Lock & HAL_BSEC_FUSE_PROG_LOCKED) != 0U)
    {
      /* Programming lock */
      SET_BIT(pHbsec->Instance->SPLOCKx[status_reg], status_bit);
    }

    if ((Lock & HAL_BSEC_FUSE_WRITE_LOCKED) != 0U)
    {
      /* Write lock */
      SET_BIT(pHbsec->Instance->SWLOCKx[status_reg], status_bit);
    }

    if ((Lock & HAL_BSEC_FUSE_RELOAD_LOCKED) != 0U)
    {
      /* Reload lock */
      SET_BIT(pHbsec->Instance->SRLOCKx[status_reg], status_bit);
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Get the sticky lock status (programming, writing shadowed register
  *         or reload), the permanent lock status, the shadow configuration,
  *         the ECC or hidden status of an OTP fuse.
  *
  * @param  pHbsec  BSEC handle
  * @param  FuseId  Fuse to get the state, this parameter value is between 0 and 375
  * @param  pState  Returned value of state. The returned value is a combination of @ref BSEC_State
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_GetState(BSEC_HandleTypeDef *const pHbsec, uint32_t FuseId, uint32_t *pState)
{
  uint32_t status_reg;
  uint32_t status_bit;
  uint32_t otpsr_reg;

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pState == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  if (FuseId < BSEC_NB_FUSES)
  {
    status_reg = FuseId / 32U;
    status_bit = (uint32_t)(1UL << (FuseId % 32U));

    /* Initialize return value */
    *pState = 0U;

    /* Check sticky programming lock */
    if ((pHbsec->Instance->SPLOCKx[status_reg] & status_bit) != 0U)
    {
      *pState |= HAL_BSEC_FUSE_PROG_LOCKED;
    }

    /* Check sticky write lock */
    if ((pHbsec->Instance->SWLOCKx[status_reg] & status_bit) != 0U)
    {
      *pState |= HAL_BSEC_FUSE_WRITE_LOCKED;
    }

    /* Check sticky reload lock */
    if ((pHbsec->Instance->SRLOCKx[status_reg] & status_bit) != 0U)
    {
      *pState |= HAL_BSEC_FUSE_RELOAD_LOCKED;
    }
    else
    {
      /* Check permanent lock : only in case of reload allowed as OTPSR reflect
         status of most recently read word */
      if (HAL_BSEC_OTP_Reload(pHbsec, FuseId) == HAL_OK)
      {
        otpsr_reg = pHbsec->Instance->OTPSR;

        if ((otpsr_reg & BSEC_OTPSR_PPLF) != 0u)
        {
          /* Permanent programming lock detected */
          *pState |= HAL_BSEC_FUSE_LOCKED;
        }
        else if ((otpsr_reg & BSEC_OTPSR_PPLMF) != 0U)
        {
          /* Permanent programming lock on the two lower fuse values in the array are not identical */
          pHbsec->ErrorCode = HAL_BSEC_PPLM_ERROR;
          return HAL_ERROR;
        }
        else
        {
          /* No permanent programming lock detected */
        }
      }
    }

    /* Check shadow configuration */
    if ((pHbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      *pState |= HAL_BSEC_FUSE_SHADOWED;
    }

    /* Check hidden status */
    if (((pHbsec->Instance->OTPSR & BSEC_OTPSR_HIDEUP) != 0U) &&
        (FuseId >= BSEC_LIMIT_UPPER_FUSES))
    {
      *pState |= HAL_BSEC_FUSE_HIDDEN;
    }

    /* Check ECC errors on all OTP fuses */
    *pState |= (pHbsec->Instance->OTPSR & (BSEC_OTPSR_OTPERR | BSEC_OTPSR_OTPSEC));

  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group3 Shadow fuse register management functions
  *  @brief   Shadow fuse register management functions
  *
@verbatim
 ===============================================================================
             ##### Shadow fuse register management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  shadow fuse registers.

      (+) Call the function HAL_BSEC_OTP_ReadShadow() to read the value of
    a shadow fuse register.

      (+) Call the function HAL_BSEC_OTP_WriteShadow() to write in a shadow
    fuse register.

      (+) Call the function HAL_BSEC_OTP_GetShadowState() to
    get the validity status of a shadow fuse register.

@endverbatim
  * @{
  */

/**
  * @brief  Read the value of a shadow fuse register.
  *
  * @param  pHbsec    BSEC handle
  * @param  RegId     Shadow register to be read, this parameter value is between 0 and 375
  * @param  pRegData  Returned value of register data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_ReadShadow(BSEC_HandleTypeDef *const pHbsec, uint32_t RegId, uint32_t *pRegData)
{
  uint32_t status_reg;
  uint32_t status_bit;

