zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pRegData == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  if (RegId < BSEC_NB_SHADOW_REG)
  {
    status_reg = RegId / 32U;
    status_bit = (uint32_t)(1UL << (RegId % 32U));

    if ((pHbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      /* Read data from shadow register */
      *pRegData = pHbsec->Instance->FVRw[RegId];
    }
    else
    {
      /* Fuse is not shadowed */
      pHbsec->ErrorCode = HAL_BSEC_UNALLOWED_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Write in a shadow fuse register.
  *
  * @param  pHbsec    BSEC handle
  * @param  RegId     Shadow register to be written, this parameter value is between 0 and 375
  * @param  RegData   Data to be written in shadow register, this parameter value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_WriteShadow(BSEC_HandleTypeDef *pHbsec, uint32_t RegId, uint32_t RegData)
{
  uint32_t status_reg;
  uint32_t status_bit;

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Get the correct register value */
  if ((RegId > BSEC_SHADOW_REG_WRITE_LIMIT) && (RegId < BSEC_NB_SHADOW_REG))
  {
    status_reg = RegId / 32U;
    status_bit = (uint32_t)(1UL << (RegId % 32U));

    if ((pHbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      if ((pHbsec->Instance->SWLOCKx[status_reg] & status_bit) == 0U)
      {
        /* Value is written in register */
        pHbsec->Instance->FVRw[RegId] = RegData;
      }
      else
      {
        /* Shadow register is sticky write locked */
        pHbsec->ErrorCode = HAL_BSEC_LOCK_ERROR;
        return HAL_ERROR;
      }
    }
    else
    {
      /* Fuse is not shadowed */
      pHbsec->ErrorCode = HAL_BSEC_UNALLOWED_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Get the validity status of a shadow register.
  *
  * @param  pHbsec     BSEC handle
  * @param  RegId      Shadow register to be checked, this parameter value is between 0 and 375
  * @param  pValidity  Returned value of validity status. The returned value is @ref BSEC_Reload_Validity
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_OTP_GetShadowState(BSEC_HandleTypeDef *const pHbsec, uint32_t RegId, uint32_t *pValidity)
{
  uint32_t status_reg;
  uint32_t status_bit;

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pValidity == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  if (RegId < BSEC_NB_SHADOW_REG)
  {
    status_reg = RegId / 32U;
    status_bit = (uint32_t)(1UL << (RegId % 32U));

    if ((pHbsec->Instance->SFSRx[status_reg] & status_bit) != 0U)
    {
      if ((pHbsec->Instance->OTPVLDRx[status_reg] & status_bit) != 0U)
      {
        *pValidity = HAL_BSEC_RELOAD_WITHOUT_ERROR;
      }
      else
      {
        *pValidity = HAL_BSEC_RELOAD_WITH_ERROR;
      }
    }
    else
    {
      /* Fuse is not shadowed */
      pHbsec->ErrorCode = HAL_BSEC_UNALLOWED_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group4 Device life cycle management functions
  *  @brief   Device life cycle management functions
  *
@verbatim
 ===============================================================================
               ##### Device life cycle management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  device life cycle.

      (+) Call the function HAL_BSEC_GetDeviceLifeCycleState() to get the
    BSEC device life cycle state.

      (+) Call the function HAL_BSEC_ReadEpochCounter() to read the value
    of epoch counter.

      (+) Call the function HAL_BSEC_SelectEpochCounter() to select the
    epoch counter used by SAES.

      (+) Call the function HAL_BSEC_GetEpochCounterSelection() to get
    the epoch counter selection for SAES.

@endverbatim
  * @{
  */

/**
  * @brief  Get the BSEC device life cycle state.
  *
  * @param  pHbsec  BSEC handle
  * @param  pState  Returned value of device life cycle state. The returned value is @ref BSEC_State
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDeviceLifeCycleState(BSEC_HandleTypeDef *const pHbsec, uint32_t *pState)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pState == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Return the state */
  *pState = (pHbsec->Instance->SR & BSEC_SR_NVSTATE);

  if (IS_BSEC_STATE(*pState))
  {
    return HAL_OK;
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_UNDEFINED_VALUE_ERROR;
    return HAL_ERROR;
  }
}

#if  defined(BSEC_EPOCHSELR_EPSEL)
/**
  * @brief  Read the value of epoch counter.
  *
  * @param  pHbsec        BSEC handle
  * @param  CounterId     Identifier of the epoch counter to be read, this parameter can be @ref BSEC_Epoch_Select
  * @param  pCounterData  Returned value of epoch counter data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ReadEpochCounter(BSEC_HandleTypeDef *const pHbsec,
                                            uint32_t CounterId, uint32_t *pCounterData)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

