zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
  /* Check the address of returned value and instance */
  if ((pCounterData == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Get the correct register value */
  if (CounterId < BSEC_NB_EPOCH_COUNTER)
  {
    *pCounterData = pHbsec->Instance->EPOCHRx[CounterId];
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Select the epoch counter used by SAES.
  *
  * @param  pHbsec            BSEC handle
  * @param  SelectedCounter   Epoch selected counter, this parameter can be @ref BSEC_Epoch_Select
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_SelectEpochCounter(BSEC_HandleTypeDef *pHbsec, uint32_t SelectedCounter)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the epoch counter selection */
  assert_param(IS_BSEC_EPOCHSEL(SelectedCounter));

  /* Update the selected epoch counter value */
  MODIFY_REG(pHbsec->Instance->EPOCHSELR, BSEC_EPOCHSELR_EPSEL, SelectedCounter);

  return HAL_OK;
}

/**
  * @brief  Get the epoch counter selection for SAES.
  *
  * @param  pHbsec            BSEC handle
  * @param  pSelectedCounter  Returned value of epoch selected counter. The returned value is @ref BSEC_Epoch_Select
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetEpochCounterSelection(BSEC_HandleTypeDef *const pHbsec, uint32_t *pSelectedCounter)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pSelectedCounter == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Return the debug request */
  *pSelectedCounter = (pHbsec->Instance->EPOCHSELR & BSEC_EPOCHSELR_EPSEL);

  return HAL_OK;
}
#endif /* defined(BSEC_EPOCHSELR_EPSEL) */

/**
  * @}
  */
#if  defined(BSEC_HDPLSR_HDPL)
/** @defgroup BSEC_Exported_Functions_Group5 HDPL management functions
  *  @brief   HDPL management functions
  *
@verbatim
 ===============================================================================
                     ##### HDPL management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  HDPL (Hide Protection Level).

      (+) Call the function HAL_BSEC_GetHDPLValue() to get the current HDPL.

      (+) Call the function HAL_BSEC_IncrementHDPLValue() to increment the HDPL.

      (+) Call the function HAL_BSEC_ConfigSAESHDPLIncrementValue() to configure
    the increment of HDPL sent to SAES.

      (+) Call the function HAL_BSEC_GetSAESHDPLIncrementValue() to get the SAES
    increment to HDPL.

@endverbatim
  * @{
  */

/**
  * @brief  Get the current HDPL.
  *
  * @param  pHbsec  BSEC handle
  * @param  pHDPL   Returned value of current HDPL. The returned value is @ref BSEC_HDPL
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetHDPLValue(BSEC_HandleTypeDef *const pHbsec, uint32_t *pHDPL)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pHDPL == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Return the HDPL */
  *pHDPL = (pHbsec->Instance->HDPLSR & BSEC_HDPLSR_HDPL);

  if (IS_BSEC_HDPL(*pHDPL))
  {
    return HAL_OK;
  }
  else
  {
    pHbsec->ErrorCode = HAL_BSEC_UNDEFINED_VALUE_ERROR;
    return HAL_ERROR;
  }
}

/**
  * @brief  Increment the HDPL.
  *
  * @param  pHbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_IncrementHDPLValue(BSEC_HandleTypeDef *pHbsec)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Increment HDPL value */
  pHbsec->Instance->HDPLCR = BSEC_HDPL_INCREMENT_CODE;

  return HAL_OK;
}

/**
  * @brief  Configure the increment of HDPL sent to SAES.
  *
  * @param  pHbsec      BSEC handle
  * @param  Increment   Value of HDPL increment, this parameter value can be between 0 and 3
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ConfigSAESHDPLIncrementValue(BSEC_HandleTypeDef *pHbsec, uint32_t Increment)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_NEXTHDPL(Increment));

  /* Write HDPL increment value */
  MODIFY_REG(pHbsec->Instance->NEXTLR, BSEC_NEXTLR_INCR, Increment);

  return HAL_OK;
}

/**
  * @brief  Get the SAES increment to HDPL.
  *
  * @param  pHbsec      BSEC handle
  * @param  pIncrement  Returned value of HDPL increment. The returned value is between 0 and 3
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetSAESHDPLIncrementValue(BSEC_HandleTypeDef *const pHbsec, uint32_t *pIncrement)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pIncrement == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Return the debug request */
  *pIncrement = (pHbsec->Instance->NEXTLR & BSEC_NEXTLR_INCR);

  return HAL_OK;
}
/**
  * @}
  */
#endif /*defined(BSEC_HDPLSR_HDPL) */
/** @defgroup BSEC_Exported_Functions_Group6 Scratch registers management functions
  *  @brief   Scratch registers management functions
  *
@verbatim
 ===============================================================================
               ##### Scratch registers management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  write once scratch and scratch registers.

