zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
      (+) Call the function HAL_BSEC_WriteScratchValue() to write a value in
    write once scratch or scratch register.

      (+) Call the function HAL_BSEC_ReadScratchValue() to read a value from
    write once scratch or scratch register.

@endverbatim
  * @{
  */

/**
  * @brief  Write a value in write once scratch or scratch register.
  *
  * @param  pHbsec    BSEC handle
  * @param  pRegAddr  Register to be written
  * @param  Data      Data to be written, this parameter can be a value between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_WriteScratchValue(BSEC_HandleTypeDef *pHbsec,
                                             BSEC_ScratchRegTypeDef *const pRegAddr, uint32_t Data)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the register configuration and instance */
  if ((pRegAddr == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_REGTYPE(pRegAddr->RegType));

  /* Write data in correct register */
  if (pRegAddr->RegType == HAL_BSEC_SCRATCH_REG)
  {
    if (pRegAddr->RegNumber < BSEC_NB_SCRATCH_REG)
    {
      pHbsec->Instance->SCRATCHRx[pRegAddr->RegNumber] = Data;
    }
    else
    {
      pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    if (pRegAddr->RegNumber < BSEC_NB_WOSCR_REG)
    {
      pHbsec->Instance->WOSCRx[pRegAddr->RegNumber] = Data;
    }
    else
    {
      pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Read a value from write once scratch or scratch register.
  *
  * @param  pHbsec    BSEC handle
  * @param  pRegAddr  Register to be read
  * @param  pRegData  Returned value of register data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ReadScratchValue(BSEC_HandleTypeDef *const pHbsec,
                                            BSEC_ScratchRegTypeDef *const pRegAddr, uint32_t *pRegData)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the register configuration, address of returned value and instance */
  if ((pRegAddr == NULL) || (pRegData == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the debug configuration */
  assert_param(IS_BSEC_REGTYPE(pRegAddr->RegType));

  /* Get the correct register value */
  if (pRegAddr->RegType == HAL_BSEC_SCRATCH_REG)
  {
    if (pRegAddr->RegNumber < BSEC_NB_SCRATCH_REG)
    {
      *pRegData = pHbsec->Instance->SCRATCHRx[pRegAddr->RegNumber];
    }
    else
    {
      pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    if (pRegAddr->RegNumber < BSEC_NB_WOSCR_REG)
    {
      *pRegData = pHbsec->Instance->WOSCRx[pRegAddr->RegNumber];
    }
    else
    {
      pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @}
  */
/**
  * @brief  Send data via JTAG.
  *
  * @param  pHbsec  BSEC handle
  * @param  Data    Data to be sent via JTAG, this parameter can be a value between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_SendJTAGData(BSEC_HandleTypeDef *pHbsec, uint32_t Data)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Send the data */
  pHbsec->Instance->JTAGOUTR = Data;

  return HAL_OK;
}

/**
  * @brief  Receive data via JTAG.
  *
  * @param  pHbsec  BSEC handle
  * @param  pData   Returned value of received data. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_ReceiveJTAGData(BSEC_HandleTypeDef *const pHbsec, uint32_t *pData)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pData == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Return the received data */
  *pData = pHbsec->Instance->JTAGINR;

  return HAL_OK;
}
/** @defgroup BSEC_Exported_Functions_Group8 DHUK management functions
  *  @brief   DHUK management functions
  *
@verbatim
 ===============================================================================
                    ##### DHUK management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the
  DHUK (Derived Hardware Unique Key).

      (+) Call the function HAL_BSEC_GetDHUKValidity() to get the validity
    of DHUK.

      (+) Call the function HAL_BSEC_LockDHUKUse() to lock the DHUK use.

      (+) Call the function HAL_BSEC_GetDHUKLockStatus() to get the DHUK
    lock status.

@endverbatim
  * @{
  */

/**
  * @brief  Get the validity of DHUK.
  *
  * @param  pHbsec     BSEC handle
  * @param  pValidity  Returned value of DHUK validity. The returned value is @ref BSEC_DHUK_Validity
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDHUKValidity(BSEC_HandleTypeDef *const pHbsec, uint32_t *pValidity)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pValidity == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Get the DHUK validity */
  *pValidity = (pHbsec->Instance->SR & BSEC_SR_HVALID);

  return HAL_OK;
}

/**
  * @brief  Lock the DHUK use.
  *
  * @param  pHbsec  BSEC handle
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_LockDHUKUse(BSEC_HandleTypeDef *pHbsec)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

