zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_bsec.c
  /* Check the instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Set the value of the DHUK lock */
  SET_BIT(pHbsec->Instance->LOCKR, BSEC_LOCKR_HKLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the DHUK lock status.
  *
  * @param  pHbsec   BSEC handle
  * @param  pStatus  Returned value of DHUK lock status. The returned value is @ref BSEC_DHUK_Lock
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetDHUKLockStatus(BSEC_HandleTypeDef *const pHbsec, uint32_t *pStatus)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pStatus == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Get the DHUK lock status */
  *pStatus = (pHbsec->Instance->LOCKR & BSEC_LOCKR_HKLOCK);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup BSEC_Exported_Functions_Group9 Reset management functions
  *  @brief   Reset management functions
  *
@verbatim
 ===============================================================================
                    ##### Reset management functions #####
 ===============================================================================
    [..]
  This subsection provides a set of functions allowing to manage the reset.

      (+) Call the function HAL_BSEC_GetNumberResets() to get the number
    of hot or warm resets.

@endverbatim
  * @{
  */

/**
  * @brief  Get the number of hot or warm resets.
  *
  * @param  pHbsec        BSEC handle
  * @param  ResetType     Type of the reset, this parameter can be a value of @ref BSEC_Reset_Type
  * @param  pResetNumber  Returned value of number of reset. The returned value is between 0 and 0xFFFFFFFFU
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_BSEC_GetNumberResets(BSEC_HandleTypeDef *const pHbsec, uint32_t ResetType, uint32_t *pResetNumber)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address of returned value and instance */
  if ((pResetNumber == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }

  /* Check the reset type */
  assert_param(IS_BSEC_RESETTYPE(ResetType));

  /* Get the correct register value */
  if (ResetType == HAL_BSEC_HOT_RESET)
  {
    *pResetNumber = pHbsec->Instance->HRCR;
  }
  else
  {
    *pResetNumber = pHbsec->Instance->WRCR;
  }

  return HAL_OK;
}
/**
  * @}
  */
/** @defgroup BSEC_Exported_Functions_Group10 Debug management functions
  *  @brief   Debug management functions
  *
  * */
/**
  * @brief   This function gets debug signals enabled/disabled status by reading BSEC register 'BSEC_DENR'.
  *
  * @param   pHbsec BSEC handle
  * @param   pDebugSignals pointer to get debug signals.
  *
  * @retval  HAL_StatusTypeDef : Returned value is either
  *
  *          HAL_OK if no error was encountered
  *          or HAL_ERROR in case one or several errors were encountered.
  */
HAL_StatusTypeDef HAL_BSEC_GetDebugSignals(BSEC_HandleTypeDef *const pHbsec, uint32_t *pDebugSignals)
{
  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }
  /* Check the address of returned value and instance */
  if ((pDebugSignals == NULL) || (pHbsec->Instance != BSEC))
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }
  /* return only the part lower 16 bits with debug signals */
  *pDebugSignals = (pHbsec->Instance->DENR & BSEC_DENR_MASK);

  return HAL_OK;
}

/**
  * @brief   This function set debug signals in register 'BSEC_DENR'
  *          This is possible if the HAL_BSEC_DENR register is not currently sticky write locked.
  *          It is checked here.
  *
  * @param   pHbsec BSEC handle
  * @param   [in] debugSignals  : debug signals to apply to HAL_BSEC_DENR' (payload part lower 16 bits).
  *
  * @retval  HAL_StatusTypeDef : Returned value is either :
  *          HAL_OK if no error was encountered
  *          or HAL_ERROR in case one or several errors were encountered.
  ******************************************************************************
  */
HAL_StatusTypeDef HAL_BSEC_SetDebugSignals(BSEC_HandleTypeDef *const pHbsec, uint32_t debugSignals)
{
  uint32_t value;

  /* Check the handle pointer */
  if (pHbsec == NULL)
  {
    return HAL_ERROR;
  }
  /* Check the address of returned value and instance */
  if (pHbsec->Instance != BSEC)
  {
    pHbsec->ErrorCode = HAL_BSEC_PARAM_ERROR;
    return HAL_ERROR;
  }
  /* Is DENABLE sticky write locked in 'BSEC_LOCKR.DENLOCK' */
  if ((pHbsec->Instance->LOCKR & BSEC_LOCKR_DENLOCK) == BSEC_LOCKR_DENLOCK)
  {
    pHbsec->ErrorCode = HAL_BSEC_LOCK_ERROR;
    return HAL_ERROR;
  }
  /* Mask signals part : 16 bits lower from input parameter 'dbgSignals' */
  /* then append write protection key on 16 bits upper part              */
  value = (debugSignals & BSEC_DENR_MASK) | BSEC_DENR_WRITE_KEY;

  /* Update the debug value */
  pHbsec->Instance->DENR = (uint32_t)value;

  return HAL_OK;
}
/**
  * @}
  */
/**
  * @}
  */

/**
  * @}
  */
#endif /* defined(BSEC) && defined(HAL_BSEC_MODULE_ENABLED) */

/**
  * @}
  */

